Revit 2026 API

# MassSurfaceDataPercentageSkylights Property

---

The target percentage of the reference roof surface that is to be covered with automatically generated skylights. Revit will use this number when determining the size, shape, and location of automatically generated skylights.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double PercentageSkylights { get; set; }
```
```vb
Public Property PercentageSkylights As Double
	Get
	Set
```
```cpp
public:
property double PercentageSkylights {
	double get ();
	void set (double value);
}
```
```fsharp
member PercentageSkylights : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The percentage skylights value is between 0.00 and 0.95. |

The resulting coverage of the roof with skylights is not guaranteed to match this value. It is a target.

#### Reference

MassSurfaceData Class

Autodesk.Revit.DB.Analysis Namespace